### Terraform Plan: `prod/base`
```
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.monitoring: Reading...
module.storage.aws_kms_key.parameter_store[0]: Refreshing state... [id=2ddbf5d2-3960-4d7c-97cd-45e7cd7fa2e6]
module.networking.aws_eip.nat["primary"]: Refreshing state... [id=eipalloc-0b4e2df477de5589c]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0e83a399bbd0d8708]
module.networking.aws_iam_role.nat[0]: Refreshing state... [id=doktori-prod-nat-role]
module.ssm_parameters.aws_ssm_parameter.this["ENABLE_RECO_SCHEDULER"]: Refreshing state... [id=/doktori/prod/ENABLE_RECO_SCHEDULER]
module.networking.data.aws_ami.nat_ubuntu: Reading...
module.ssm_parameters.aws_ssm_parameter.this["AWS_REGION"]: Refreshing state... [id=/doktori/prod/AWS_REGION]
module.networking.aws_eip.nat["secondary"]: Refreshing state... [id=eipalloc-04c04642eb6b40713]
module.storage.aws_s3_bucket.this["app"]: Refreshing state... [id=doktori-v2-prod]
module.ssm_parameters.aws_ssm_parameter.this["ZOOM_CLIENT_SECRET"]: Refreshing state... [id=/doktori/prod/ZOOM_CLIENT_SECRET]
module.networking.data.aws_ami.nat_ubuntu: Read complete after 1s [id=ami-067069a366ec13118]
module.ssm_parameters.aws_ssm_parameter.this["RUNPOD_ENDPOINT_ID"]: Refreshing state... [id=/doktori/prod/RUNPOD_ENDPOINT_ID]
module.ssm_parameters.aws_ssm_parameter.this["DB_NAME"]: Refreshing state... [id=/doktori/prod/DB_NAME]
module.ssm_parameters.aws_ssm_parameter.this["JWT_SECRET"]: Refreshing state... [id=/doktori/prod/JWT_SECRET]
module.ssm_parameters.aws_ssm_parameter.this["DB_USERNAME"]: Refreshing state... [id=/doktori/prod/DB_USERNAME]
data.terraform_remote_state.monitoring: Read complete after 2s
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_CLIENT_SECRET"]: Refreshing state... [id=/doktori/prod/KAKAO_CLIENT_SECRET]
module.ssm_parameters.aws_ssm_parameter.this["AI_API_KEY"]: Refreshing state... [id=/doktori/prod/AI_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_REDIRECT_URI"]: Refreshing state... [id=/doktori/prod/KAKAO_REDIRECT_URI]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_RABBITMQ_PASSWORD"]: Refreshing state... [id=/doktori/prod/SPRING_RABBITMQ_PASSWORD]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_REDIS_HOST"]: Refreshing state... [id=/doktori/prod/SPRING_REDIS_HOST]
module.ssm_parameters.aws_ssm_parameter.this["AWS_S3_BUCKET_NAME"]: Refreshing state... [id=/doktori/prod/AWS_S3_BUCKET_NAME]
module.ssm_parameters.aws_ssm_parameter.this["DISCORD_WEBHOOK_URL"]: Refreshing state... [id=/doktori/prod/DISCORD_WEBHOOK_URL]
module.ssm_parameters.aws_ssm_parameter.this["ECR_REGISTRY"]: Refreshing state... [id=/doktori/prod/ECR_REGISTRY]
module.ssm_parameters.aws_ssm_parameter.this["AWS_S3_DB_BACKUP"]: Refreshing state... [id=/doktori/prod/AWS_S3_DB_BACKUP]
module.ssm_parameters.aws_ssm_parameter.this["GEMINI_API_KEY"]: Refreshing state... [id=/doktori/prod/GEMINI_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["AI_BASE_URL"]: Refreshing state... [id=/doktori/prod/AI_BASE_URL]
module.ssm_parameters.aws_ssm_parameter.this["AI_DB_URL"]: Refreshing state... [id=/doktori/prod/AI_DB_URL]
module.ssm_parameters.aws_ssm_parameter.this["AWS_S3_ENDPOINT"]: Refreshing state... [id=/doktori/prod/AWS_S3_ENDPOINT]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_PROJECT_ID"]: Refreshing state... [id=/doktori/prod/NEXT_PUBLIC_FIREBASE_PROJECT_ID]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_API_BASE_URL_PROD"]: Refreshing state... [id=/doktori/prod/NEXT_PUBLIC_API_BASE_URL_PROD]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_FRONTEND_REDIRECT"]: Refreshing state... [id=/doktori/prod/KAKAO_FRONTEND_REDIRECT]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_REST_API_KEY"]: Refreshing state... [id=/doktori/prod/KAKAO_REST_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["AWS_S3_ENABLED"]: Refreshing state... [id=/doktori/prod/AWS_S3_ENABLED]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_RABBITMQ_PORT"]: Refreshing state... [id=/doktori/prod/SPRING_RABBITMQ_PORT]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_RABBITMQ_HOST"]: Refreshing state... [id=/doktori/prod/SPRING_RABBITMQ_HOST]
module.ssm_parameters.aws_ssm_parameter.this["FIREBASE_SERVICE_ACCOUNT"]: Refreshing state... [id=/doktori/prod/FIREBASE_SERVICE_ACCOUNT]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_REDIS_PORT"]: Refreshing state... [id=/doktori/prod/SPRING_REDIS_PORT]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_CHAT_BASE_URL_PROD"]: Refreshing state... [id=/doktori/prod/NEXT_PUBLIC_CHAT_BASE_URL_PROD]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_MESSAGING_SENDER_ID"]: Refreshing state... [id=/doktori/prod/NEXT_PUBLIC_FIREBASE_MESSAGING_SENDER_ID]
module.ssm_parameters.aws_ssm_parameter.this["RUNPOD_POLL_TIMEOUT_SECONDS"]: Refreshing state... [id=/doktori/prod/RUNPOD_POLL_TIMEOUT_SECONDS]
module.ssm_parameters.aws_ssm_parameter.this["RECO_SCHEDULER_SEARCH_K"]: Refreshing state... [id=/doktori/prod/RECO_SCHEDULER_SEARCH_K]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_RABBITMQ_USERNAME"]: Refreshing state... [id=/doktori/prod/SPRING_RABBITMQ_USERNAME]
module.ssm_parameters.aws_ssm_parameter.this["RUNPOD_POLL_INTERVAL_SECONDS"]: Refreshing state... [id=/doktori/prod/RUNPOD_POLL_INTERVAL_SECONDS]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_STORAGE_BUCKET"]: Refreshing state... [id=/doktori/prod/NEXT_PUBLIC_FIREBASE_STORAGE_BUCKET]
module.ssm_parameters.aws_ssm_parameter.this["RECO_SCHEDULER_TZ"]: Refreshing state... [id=/doktori/prod/RECO_SCHEDULER_TZ]
module.ssm_parameters.aws_ssm_parameter.this["RECO_SCHEDULER_CRON"]: Refreshing state... [id=/doktori/prod/RECO_SCHEDULER_CRON]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_CHAT_WS_PATH"]: Refreshing state... [id=/doktori/prod/NEXT_PUBLIC_CHAT_WS_PATH]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_VAPID_KEY"]: Refreshing state... [id=/doktori/prod/NEXT_PUBLIC_FIREBASE_VAPID_KEY]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_AUTH_DOMAIN"]: Refreshing state... [id=/doktori/prod/NEXT_PUBLIC_FIREBASE_AUTH_DOMAIN]
module.ssm_parameters.aws_ssm_parameter.this["RUNPOD_API_KEY"]: Refreshing state... [id=/doktori/prod/RUNPOD_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["AWS_DEPLOY_ROLE_ARN"]: Refreshing state... [id=/doktori/prod/AWS_DEPLOY_ROLE_ARN]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_GA_ID"]: Refreshing state... [id=/doktori/prod/NEXT_PUBLIC_GA_ID]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_APPID"]: Refreshing state... [id=/doktori/prod/NEXT_PUBLIC_FIREBASE_APPID]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_CLIENT_ID"]: Refreshing state... [id=/doktori/prod/KAKAO_CLIENT_ID]
module.ssm_parameters.aws_ssm_parameter.this["QODANA_TOKEN"]: Refreshing state... [id=/doktori/prod/QODANA_TOKEN]
module.ssm_parameters.aws_ssm_parameter.this["DB_URL"]: Refreshing state... [id=/doktori/prod/DB_URL]
module.ssm_parameters.aws_ssm_parameter.this["ZOOM_ACCOUNT_ID"]: Refreshing state... [id=/doktori/prod/ZOOM_ACCOUNT_ID]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_API_KEY"]: Refreshing state... [id=/doktori/prod/NEXT_PUBLIC_FIREBASE_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["GEMINI_MODEL"]: Refreshing state... [id=/doktori/prod/GEMINI_MODEL]
module.ssm_parameters.aws_ssm_parameter.this["SENTRY_AUTH_TOKEN"]: Refreshing state... [id=/doktori/prod/SENTRY_AUTH_TOKEN]
module.ssm_parameters.aws_ssm_parameter.this["ZOOM_CLIENT_ID"]: Refreshing state... [id=/doktori/prod/ZOOM_CLIENT_ID]
module.ssm_parameters.aws_ssm_parameter.this["RECO_SCHEDULER_TOP_K"]: Refreshing state... [id=/doktori/prod/RECO_SCHEDULER_TOP_K]
module.networking.aws_iam_instance_profile.nat[0]: Refreshing state... [id=doktori-prod-nat-profile]
module.networking.aws_iam_role_policy_attachment.nat_ssm[0]: Refreshing state... [id=doktori-prod-nat-role-20260315155317506000000001]
module.storage.aws_kms_alias.parameter_store[0]: Refreshing state... [id=alias/doktori-prod-parameter-store]
module.storage.aws_iam_policy.parameter_store_read[0]: Refreshing state... [id=arn:aws:iam::250857930609:policy/doktori-prod-parameter-store-read]
module.networking.aws_security_group.nat: Refreshing state... [id=sg-0ff303f904f40fb0e]
module.networking.aws_subnet.this["public"]: Refreshing state... [id=subnet-06bc8d99298aba7bb]
module.networking.aws_subnet.this["public_c"]: Refreshing state... [id=subnet-04349f32bab66215b]
module.networking.aws_subnet.this["private_app"]: Refreshing state... [id=subnet-0a6a3170675ee0f55]
module.networking.aws_subnet.this["private_app_b"]: Refreshing state... [id=subnet-0b67a628c8dd39ee5]
module.networking.aws_subnet.this["private_rds"]: Refreshing state... [id=subnet-0172f03758f345141]
module.networking.aws_subnet.this["private_app_c"]: Refreshing state... [id=subnet-0ee225a3ffa7aec56]
module.networking.aws_subnet.this["private_db"]: Refreshing state... [id=subnet-0245c7f2cb5b4f74c]
module.networking.aws_subnet.this["public_b"]: Refreshing state... [id=subnet-0b23661b1c71a30eb]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-0e93963b76eb8eac6]
module.networking.aws_route_table.private["primary"]: Refreshing state... [id=rtb-09c76d5f75d9e9a8e]
module.networking.aws_route_table.private["secondary"]: Refreshing state... [id=rtb-0c84c517990f1335e]
module.networking.aws_route53_zone.internal: Refreshing state... [id=Z04783583MC5PWNZP04CM]
module.networking.aws_security_group.vpc_endpoints[0]: Refreshing state... [id=sg-0000c7a15e032178c]
module.storage.aws_s3_bucket_server_side_encryption_configuration.this["app"]: Refreshing state... [id=doktori-v2-prod]
module.storage.aws_s3_object.folders["app/images/meetings/"]: Refreshing state... [id=images/meetings/]
module.storage.aws_s3_object.folders["app/images/profiles/"]: Refreshing state... [id=images/profiles/]
module.storage.aws_s3_object.folders["app/backup/"]: Refreshing state... [id=backup/]
module.storage.aws_s3_object.folders["app/images/reviews/"]: Refreshing state... [id=images/reviews/]
module.storage.aws_s3_bucket_public_access_block.this["app"]: Refreshing state... [id=doktori-v2-prod]
module.storage.aws_s3_bucket_versioning.this["app"]: Refreshing state... [id=doktori-v2-prod]
module.storage.aws_s3_bucket_cors_configuration.this["app"]: Refreshing state... [id=doktori-v2-prod]
data.aws_route_table.mgmt_main: Reading...
module.networking.aws_route_table.public: Refreshing state... [id=rtb-0dbab22558bb86ee5]
module.networking.aws_vpc_endpoint.interface["logs"]: Refreshing state... [id=vpce-0dcce7245ecd98cdd]
module.networking.aws_vpc_endpoint.interface["ecr.dkr"]: Refreshing state... [id=vpce-06efffe2435e8835b]
data.aws_route_table.mgmt_main: Read complete after 0s [id=rtb-03775d662931f2893]
module.networking.aws_vpc_endpoint.interface["ec2messages"]: Refreshing state... [id=vpce-078cababbe37263a0]
module.networking.aws_vpc_endpoint.interface["ssm"]: Refreshing state... [id=vpce-0e0076f9129a7ba73]
module.networking.aws_vpc_endpoint.interface["ecr.api"]: Refreshing state... [id=vpce-0646f2b4be9a20582]
module.networking.aws_vpc_endpoint.interface["ssmmessages"]: Refreshing state... [id=vpce-07028b226c7ed90e7]
module.storage.aws_s3_bucket_policy.this["app"]: Refreshing state... [id=doktori-v2-prod]
module.networking.aws_instance.nat["primary"]: Refreshing state... [id=i-0cd3eb3a6234bfc99]
module.networking.aws_instance.nat["secondary"]: Refreshing state... [id=i-0f814667cfb56839b]
module.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0654ebb7f4295ea6d]
module.networking.aws_route_table_association.this["private_app_c"]: Refreshing state... [id=rtbassoc-090b2db37b9166743]
module.networking.aws_route_table_association.this["private_db"]: Refreshing state... [id=rtbassoc-0e8ad39f871ec0f59]
module.networking.aws_route_table_association.this["public"]: Refreshing state... [id=rtbassoc-001f1a8b8cf3b3aa0]
module.networking.aws_route_table_association.this["public_b"]: Refreshing state... [id=rtbassoc-09eb8ab0d6d810863]
module.networking.aws_route_table_association.this["public_c"]: Refreshing state... [id=rtbassoc-0b1454d822d8d7073]
module.networking.aws_route_table_association.this["private_app_b"]: Refreshing state... [id=rtbassoc-0648e56511289097b]
module.networking.aws_route_table_association.this["private_rds"]: Refreshing state... [id=rtbassoc-02736e6eb756a655b]
module.networking.aws_route_table_association.this["private_app"]: Refreshing state... [id=rtbassoc-0c5a01ddeb13a16d1]
module.networking.aws_eip_association.nat["secondary"]: Refreshing state... [id=eipassoc-0e486fb37cdaaac43]
module.networking.aws_eip_association.nat["primary"]: Refreshing state... [id=eipassoc-05ab9fabef9e4fbc9]
module.networking.aws_route.private_nat["secondary"]: Refreshing state... [id=r-rtb-0c84c517990f1335e1080289494]
module.networking.aws_route.private_nat["primary"]: Refreshing state... [id=r-rtb-09c76d5f75d9e9a8e1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route.mgmt_to_prod will be created
  + resource "aws_route" "mgmt_to_prod" {
      + destination_cidr_block    = "10.1.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-03775d662931f2893"
      + state                     = (known after apply)
      + vpc_peering_connection_id = (known after apply)
    }

  # aws_route.prod_private_to_mgmt["primary"] will be created
  + resource "aws_route" "prod_private_to_mgmt" {
      + destination_cidr_block    = "172.31.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-09c76d5f75d9e9a8e"
      + state                     = (known after apply)
      + vpc_peering_connection_id = (known after apply)
    }

  # aws_route.prod_private_to_mgmt["secondary"] will be created
  + resource "aws_route" "prod_private_to_mgmt" {
      + destination_cidr_block    = "172.31.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-0c84c517990f1335e"
      + state                     = (known after apply)
      + vpc_peering_connection_id = (known after apply)
    }

  # aws_route.prod_public_to_mgmt will be created
  + resource "aws_route" "prod_public_to_mgmt" {
      + destination_cidr_block    = "172.31.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-0dbab22558bb86ee5"
      + state                     = (known after apply)
      + vpc_peering_connection_id = (known after apply)
    }

  # aws_vpc_peering_connection.prod_to_mgmt will be created
  + resource "aws_vpc_peering_connection" "prod_to_mgmt" {
      + accept_status = (known after apply)
      + auto_accept   = true
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = (known after apply)
      + peer_vpc_id   = "vpc-0b86daeaa3abb4e4f"
      + tags          = {
          + "Name" = "doktori-prod-to-mgmt"
        }
      + tags_all      = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-prod-to-mgmt"
          + "Project"     = "doktori"
        }
      + vpc_id        = "vpc-0e83a399bbd0d8708"

      + accepter (known after apply)

      + requester (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ networking = {
      + public_route_table_id   = "rtb-0dbab22558bb86ee5"
        # (9 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```